**free

dcl-s textArray varchar(30) dim(10);
dcl-s i uns(5);
dcl-s j uns(5);
dcl-s line varchar(30);
dcl-s first varchar(1);

//textArray(1) = ' erstes Beispiel';
//textArray(4) = ' RPG programmierung    ';
//textArray(6) = ' zahlen: 123456   ';
//textArray(8) = ' maus ';

//textArray(1) = ' zweites Beispiel';
//textArray(3) = ' CL Programmierung    ';
//textArray(5) = ' zahlen: 123456   ';
//textArray(9) = ' maus ';

//textArray(3) = ' drittes Beispiel';
//textArray(4) = '    Python Programmierung';
//textArray(5) = '123456   ';
//textArray(6) = ' Haus'; //

//textArray(1) = ' viertes Beispiel';
//textArray(2) = ' RPG programmierung    ';
//textArray(3) = '    %%%%%%%   %% ';
//textArray(4) = ' maus ';

textArray(1) = ' Beispiel   ';
textArray(2) = '     Programmierung    ';
textArray(6) = ' loloolololo   ';
textArray(7) = ' Pause ';

j = 0;  //zählt nichtleere zeilen
For i = 1 to %elem(textArray);
   line = %trim(textArray(i));
   If line <> '';
      first = %subst(line:1:1);
      first = %upper(first);
      line = first + %subst(line:2);
      textArray(i) = '';
      j += 1;
      textArray(j) = line;
      dsply line;
   EndIf;
EndFor;

*inLR = *on;
