**free
dcl-s gruss char(12);
dcl-s eingabe varchar(10);
dcl-s gepackte_zahl packed(7:2);
dcl-s gezonte_zahl zoned(7:2);
dcl-s ganze_zahl int(3);
dcl-s natuerliche_zahl uns(5);
dcl-s indikator ind;
dcl-s datum date;
dcl-s uhrzeit time;
dcl-s zeitpunkt timestamp;
dcl-s outstring char(1000);
gruss = 'Hello World!';
eingabe = 'Misspellad';
gepackte_zahl = 10000.33;
gezonte_zahl = 10000.33;
ganze_zahl = -10;
natuerliche_zahl = 10;
indikator = *OFF;
datum = %date();
uhrzeit = %time();
zeitpunkt = %timestamp();
dsply ('Mein Gruss: ' + gruss);
dsply ('Meine Eingabe: ' + eingabe);
dsply ('Gepackte Zahl: ' + %char(gepackte_zahl));
dsply ('Gezonte Zahl: ' + %char(gezonte_zahl));
dsply ('Ganze Zahl: ' + %char(ganze_zahl));
dsply ('Natuerliche Zahl: ' + %char(natuerliche_zahl));
dsply ('Mein Indikator: ' + %char(indikator));
dsply ('Datum: ' + %char(datum));
dsply ('Uhrzeit: ' + %char(uhrzeit));
dsply ('Zeitpunkt: ' + %char(zeitpunkt));

*inLR = *on;
