**free
ctl-opt main(rechner) dftactgrp(*NO) BNDDIR('BNDDIR');

/Include qcpysrc,verbinder

  // --------------------------------------------------
  // Prototype for procedure: main
  // --------------------------------------------------
DCL-PROC rechner ;
    DCL-PI *n;
        input1 CHAR(5) const;
        input2 CHAR(5) const;
    END-PI ;

    dsply verbinder(input1: input2);
    return;

END-PROC ;

